Repository: antOnioOnio/agc_web_resume
Catalog: lib/core/l10n/app_*.arb
Languages: es

# presentation_text
source: Presentation
es: Presentación

# presentation_description
source: I am a mobile app developer with 4 years of experience, specializing in Flutter development. I began my career developing Android apps for a year before discovering Flutter, which I fell in love with due to its flexibility and ease of use, leading me to focus on it ever since. In addition to my experience in mobile app development and strong emphasis on good architecture in all of my projects, I have also led small teams. As a team leader, I effectively manage project timelines and ensure that all team members are aware of their responsibilities and expectations. I encourage communication and collaboration among team members, while providing guidance and support as needed. Furthermore, I have advanced language skills in English, having lived in London for two years a decade ago. This has allowed me to collaborate effectively with English-speaking teams and work on international projects.
es: Soy un desarrollador de aplicaciones móviles con 4 años de experiencia, especializado en el desarrollo de Flutter. Comencé mi carrera desarrollando aplicaciones para Android durante un año antes de descubrir Flutter, de la que me enamoré debido a su flexibilidad y facilidad de uso, lo que me llevó a enfocarme en ella desde entonces. Además de mi experiencia en el desarrollo de aplicaciones móviles y un fuerte énfasis en una buena arquitectura en todos mis proyectos, también he liderado pequeños equipos. Como líder de equipo, administro eficazmente los plazos del proyecto y me aseguro de que todos los miembros del equipo sean conscientes de sus responsabilidades y expectativas. Fomento la comunicación y la colaboración entre los miembros del equipo, y brindo orientación y apoyo según sea necesario. Además, tengo habilidades avanzadas en el idioma inglés, ya que viví en Londres durante dos años hace una década. Esto me ha permitido colaborar eficazmente con equipos de habla inglesa y trabajar en proyectos internacionales.

# job_position_text
source: SENIOR FLUTTER SOFTWARE DEVELOPER IN ACCENTURE
es: DESARROLLADOR SENIOR DE SOFTWARE FLUTTER EN ACCENTURE

# work_place_text
source: Granada, Spain
es: Granada, España

# work_experience_text
source: Work Experience
es: Experiencia laboral

# accenture_work_header
source: Accenture - Senior Flutter Software Developer
es: Accenture - Desarrollador Senior de Software Flutter

# accenture_work_place
source: Malaga
es: Málaga

# accenture_work_period
source: 01/2023 - Present
es: 01/2023 - Presente

# accenture_description_row_1
source: Developed new features for Flutter applications to enhance their functionality and user experience.
es: Desarrollé nuevas funciones para aplicaciones Flutter para mejorar su funcionalidad y experiencia de usuario.

# accenture_description_row_2
source: Led a small team of 4 developers, coordinating their efforts to ensure the timely completion of projects and successful delivery to clients.
es: Lideré un pequeño equipo de 4 desarrolladores, coordinando sus esfuerzos para garantizar la finalización oportuna de proyectos y la entrega exitosa a los clientes.

# accenture_description_row_3
source: Reviewed code submitted by team members, providing constructive feedback to improve code quality and maintainability.
es: Revisé el código presentado por los miembros del equipo, brindando comentarios constructivos para mejorar la calidad y la mantenibilidad del código.

# accenture_description_row_4
source: Wrote documentation to capture project requirements, design decisions, and implementation details, ensuring that all stakeholders had access to relevant information and could effectively collaborate on the project.
es: Escribí documentación para capturar los requisitos del proyecto, las decisiones de diseño y los detalles de implementación, asegurándome de que todos los interesados tuvieran acceso a información relevante y pudieran colaborar eficazmente en el proyecto.

# blindside_work_header
source: Blindside - Flutter Software Developer
es: Blindside - Desarrollador de software Flutter

# blindside_work_place
source: Berlin
es: Berlín

# blindside_description_row_1
source: Revised, modularized and updated old code bases to modern development standards using Riverpod as state management and MVVP architecture with Repository Pattern and Hive as local database.
es: Revisé, modularicé y actualicé bases de código antiguas a estándares modernos de desarrollo utilizando Riverpod como gestión de estado y arquitectura MVVP con patrón Repository y Hive como base de datos local.

# blindside_description_row_2
source: Took initial concepts and mockups and developed complete new sub-project modules always trying to follow the best code practices.
es: Tomé conceptos iniciales y bocetos y desarrollé módulos de subproyectos completos siempre tratando de seguir las mejores prácticas de código.

# blindside_description_row_3
source: Reviewed code, debugged problems and corrected issues.
es: Revisé el código, solucioné problemas y corregí errores.

# blindside_description_row_4
source: Documented technical workflows and knowledge in private outline for education of newly hired employees.
es: Documentó flujos de trabajo técnicos y conocimientos en un esquema privado para la formación de nuevos empleados contratados.

# blindside_description_row_5
source: Coordinated pipelines and deployments to Google Store and AppStoreConnect of new updated and fixes using Bitbucket + Codemagic.
es: Coordinó la creación y despliegue de nuevas actualizaciones y correcciones en Google Store y AppStoreConnect utilizando Bitbucket + Codemagic.

# veleta_work_header
source: Veleta Solutions - Mobile Software Developer
es: Veleta Solutions - Desarrollador de software móvil

# veleta_description_row_1
source: Collaborated in stages of systems development lifecycle from requirement gathering to production releases.'
es: Colaboré en etapas del ciclo de vida del desarrollo de sistemas desde la recopilación de requisitos hasta la liberación en producción.

# veleta_description_row_2
source: Led the development of several apps for different companies in different fields that go from airport stores, swiss telecommunications or delivery companies.'
es: Lideré el desarrollo de varias aplicaciones para diferentes empresas en diferentes campos que van desde tiendas de aeropuerto, telecomunicaciones suizas o empresas de entrega.

# veleta_description_row_3
source: Employed third-party APIs to facilitate seamless access to external, in-app cloud data.'
es: Utilicé APIs de terceros para facilitar el acceso fluido a datos externos en la nube de la aplicación.

# veleta_description_row_4
source: Designed and maintained streamlined, reusable and reliable code for use within distributed cloud environments.'
es: Diseñé y mantuve un código eficiente, reutilizable y confiable para su uso en entornos de nube distribuidos.

# veleta_description_row_5
source: Designed and maintained streamlined, reusable and reliable code for use within distributed cloud environments.'
es: Diseñé y mantuve un código eficiente, reutilizable y confiable para su uso en entornos de nube distribuidos.

# veleta_description_row_6
source: Created custom mobile applications using native and hybrid technologies.
es: Creé aplicaciones móviles personalizadas utilizando tecnologías nativas e híbridas.
